//5. Написать программу вычисления значения функции y=f(a)
double a = 5;
double y = Math.Sin(a);
Console.WriteLine(y);
